In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {'names': ['Alex', 'Alex', 'Alex', 'Leon', 'Leon'],
       'year': [2014, 2015, 2016, 2015, 2017],
       'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data, columns=['year', 'names', 'points', 'penalty'], index=['one','two','three','four','five'])

In [4]:
df

       year names  points penalty
one    2014  Alex     1.5     NaN
two    2015  Alex     1.7     NaN
three  2016  Alex     3.6     NaN
four   2015  Leon     2.4     NaN
five   2017  Leon     2.9     NaN

In [5]:
df['year']

one      2014
two      2015
three    2016
four     2015
five     2017
Name: year, dtype: int64

In [6]:
df.year

one      2014
two      2015
three    2016
four     2015
five     2017
Name: year, dtype: int64

In [7]:
df[['year', 'points']]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2017     2.9

In [8]:
df['penalty'] = 0.5

In [9]:
df

       year names  points  penalty
one    2014  Alex     1.5      0.5
two    2015  Alex     1.7      0.5
three  2016  Alex     3.6      0.5
four   2015  Leon     2.4      0.5
five   2017  Leon     2.9      0.5

In [10]:
df['penalty'] = [0.1,0.2,0.3,0.4,0.5]

In [11]:
df

       year names  points  penalty
one    2014  Alex     1.5      0.1
two    2015  Alex     1.7      0.2
three  2016  Alex     3.6      0.3
four   2015  Leon     2.4      0.4
five   2017  Leon     2.9      0.5

In [12]:
df['zeroes'] = np.arange(5)

In [13]:
df

       year names  points  penalty  zeroes
one    2014  Alex     1.5      0.1       0
two    2015  Alex     1.7      0.2       1
three  2016  Alex     3.6      0.3       2
four   2015  Leon     2.4      0.4       3
five   2017  Leon     2.9      0.5       4

In [14]:
val = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])

In [15]:
df['debt'] = val

In [16]:
df

       year names  points  penalty  zeroes  debt
one    2014  Alex     1.5      0.1       0   NaN
two    2015  Alex     1.7      0.2       1  -1.2
three  2016  Alex     3.6      0.3       2   NaN
four   2015  Leon     2.4      0.4       3  -1.5
five   2017  Leon     2.9      0.5       4  -1.7

In [17]:
df['net_points'] = df['points'] - df['penalty']

In [19]:
df['high_points'] = df['net_points'] > 2.0

In [20]:
df

       year names  points  penalty  zeroes  debt  net_points  high_points
one    2014  Alex     1.5      0.1       0   NaN         1.4        False
two    2015  Alex     1.7      0.2       1  -1.2         1.5        False
three  2016  Alex     3.6      0.3       2   NaN         3.3         True
four   2015  Leon     2.4      0.4       3  -1.5         2.0        False
five   2017  Leon     2.9      0.5       4  -1.7         2.4         True

In [21]:
del df['high_points']

In [22]:
del df['net_points']

In [23]:
del df['debt']

In [24]:
df

       year names  points  penalty  zeroes
one    2014  Alex     1.5      0.1       0
two    2015  Alex     1.7      0.2       1
three  2016  Alex     3.6      0.3       2
four   2015  Leon     2.4      0.4       3
five   2017  Leon     2.9      0.5       4

In [25]:
df.columns

Index(['year', 'names', 'points', 'penalty', 'zeroes'], dtype='object')

In [26]:
df.index.name = 'Order'
df.columns.name = 'Info'

In [27]:
df

Info   year names  points  penalty  zeroes
Order
one    2014  Alex     1.5      0.1       0
two    2015  Alex     1.7      0.2       1
three  2016  Alex     3.6      0.3       2
four   2015  Leon     2.4      0.4       3
five   2017  Leon     2.9      0.5       4

In [28]:
df[0:3]

Info   year names  points  penalty  zeroes
Order
one    2014  Alex     1.5      0.1       0
two    2015  Alex     1.7      0.2       1
three  2016  Alex     3.6      0.3       2

In [29]:
df['two':'four']

Info   year names  points  penalty  zeroes
Order
two    2015  Alex     1.7      0.2       1
three  2016  Alex     3.6      0.3       2
four   2015  Leon     2.4      0.4       3

In [33]:
df.loc['two']

Info
year       2015
names      Alex
points      1.7
penalty     0.2
zeroes        1
Name: two, dtype: object

In [34]:
df.loc['two':'four']

Info   year names  points  penalty  zeroes
Order
two    2015  Alex     1.7      0.2       1
three  2016  Alex     3.6      0.3       2
four   2015  Leon     2.4      0.4       3

In [35]:
df.loc['two':'four','points']

Order
two      1.7
three    3.6
four     2.4
Name: points, dtype: float64

In [36]:
df.loc[:, 'year']

Order
one      2014
two      2015
three    2016
four     2015
five     2017
Name: year, dtype: int64

In [37]:
df.loc[:, ['year', 'names']]

Info   year names
Order
one    2014  Alex
two    2015  Alex
three  2016  Alex
four   2015  Leon
five   2017  Leon

In [38]:
df.loc['three':'five', 'year': 'penalty']

Info   year names  points  penalty
Order
three  2016  Alex     3.6      0.3
four   2015  Leon     2.4      0.4
five   2017  Leon     2.9      0.5

In [39]:
df.loc['six', :] = [2014, 'Sami', 4.0, 0.1, 2.1]

In [40]:
df

Info     year names  points  penalty  zeroes
Order
one    2014.0  Alex     1.5      0.1     0.0
two    2015.0  Alex     1.7      0.2     1.0
three  2016.0  Alex     3.6      0.3     2.0
four   2015.0  Leon     2.4      0.4     3.0
five   2017.0  Leon     2.9      0.5     4.0
six    2014.0  Sami     4.0      0.1     2.1

In [41]:
df.iloc[3]

Info
year       2015
names      Leon
points      2.4
penalty     0.4
zeroes        3
Name: four, dtype: object

In [42]:
df.iloc[3:5, 0:2]

Info     year names
Order
four   2015.0  Leon
five   2017.0  Leon

In [43]:
df.iloc[[0,1,3], [1,2]]

Info  names  points
Order
one    Alex     1.5
two    Alex     1.7
four   Leon     2.4

In [44]:
df.iloc[:, 1:4]

Info  names  points  penalty
Order
one    Alex     1.5      0.1
two    Alex     1.7      0.2
three  Alex     3.6      0.3
four   Leon     2.4      0.4
five   Leon     2.9      0.5
six    Sami     4.0      0.1

In [45]:
df.iloc[1,1]

'Alex'

In [46]:
df

Info     year names  points  penalty  zeroes
Order
one    2014.0  Alex     1.5      0.1     0.0
two    2015.0  Alex     1.7      0.2     1.0
three  2016.0  Alex     3.6      0.3     2.0
four   2015.0  Leon     2.4      0.4     3.0
five   2017.0  Leon     2.9      0.5     4.0
six    2014.0  Sami     4.0      0.1     2.1

In [47]:
df['year'] > 2014

Order
one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [49]:
df.loc[df['year'] > 2014, :]

Info     year names  points  penalty  zeroes
Order
two    2015.0  Alex     1.7      0.2     1.0
three  2016.0  Alex     3.6      0.3     2.0
four   2015.0  Leon     2.4      0.4     3.0
five   2017.0  Leon     2.9      0.5     4.0

In [50]:
df.loc[df['names'] == 'Alex', ['names', 'points']]

Info  names  points
Order
one    Alex     1.5
two    Alex     1.7
three  Alex     3.6

In [52]:
df.loc[(df['points']>2) & (df['points']<3), :]

Info     year names  points  penalty  zeroes
Order
four   2015.0  Leon     2.4      0.4     3.0
five   2017.0  Leon     2.9      0.5     4.0

In [53]:
df.loc[df['points']>3, 'penalty'] = 0

In [54]:
df

Info     year names  points  penalty  zeroes
Order
one    2014.0  Alex     1.5      0.1     0.0
two    2015.0  Alex     1.7      0.2     1.0
three  2016.0  Alex     3.6      0.0     2.0
four   2015.0  Leon     2.4      0.4     3.0
five   2017.0  Leon     2.9      0.5     4.0
six    2014.0  Sami     4.0      0.0     2.1